In [1]:
import pandas as pd

nba_revenue_csv = "nba_revenue.csv"
player_salary_csv = "player_salary.csv"
salary_cap_csv = "salary_cap.csv"
tv_viewership_csv = "tv_viewership.csv"

In [2]:
nba_revenue_df = pd.read_csv(nba_revenue_csv)
player_salary_df = pd.read_csv(player_salary_csv)
player_salaries_df = player_salary_df[['Year','Team','Player','Salary']]
salary_cap_df = pd.read_csv(salary_cap_csv)
tv_viewership_df = pd.read_csv(tv_viewership_csv)

In [3]:
nba_revenue_df.head()

        Year  NBA Revenue (Billions of $)
0    2001/02                         2.66
1    2002/03                         2.72
2    2003/04                         2.93
3  2004/05**                         3.19
4    2005/06                         3.37

In [42]:
player_salaries_df.head()

   Year           Team          Player      Salary
0  2017  Atlanta Hawks   Dwight Howard  23,180,275
1  2017  Atlanta Hawks    Paul Millsap  20,072,033
2  2017  Atlanta Hawks   Kent Bazemore  15,730,338
3  2017  Atlanta Hawks  Tiago Splitter   8,550,000
4  2017  Atlanta Hawks     Kyle Korver   5,239,437

In [18]:
salary_cap_df = salary_cap_df.dropna(how='any')
new_year = salary_cap_df['Year'].astype(int)
salary_cap_df['Year'] = new_year
salary_cap_df.head()

   Year Salary Cap (2015 USD)
0  1984           $7,934,034
1  1985           $9,153,509
2  1986          $10,317,292
3  1987          $12,354,015
4  1988          $13,829,137

In [9]:
tv_viewership_df.head()

   Year  Viewership (millions)
0  2002                  15.68
1  2003                   9.86
2  2004                  17.94
3  2005                  12.54
4  2006                  12.97